"""
各カードに'1'から'13'までの数が書かれたポーカー用のトランプがある。
カードの強さは下記の通りである。
弱'2'<'3'<'4'......<'12'<'13'<'1'強

1枚ポーカーは以下の手順で行う。
・各プレイヤーはトランプからカードを１枚選び、自分の札とする
・両プレイヤーは手札を見せ合う。強いカードを持っているプレイヤーが勝ちです。
　両プレイヤーの持っているカードの強さが同じであれば引き合わけとなる。

Aliceの手札A、Bobの手札Bを見たときに勝敗を判定するプログラムを作る。

制約
・1 <= A <= 13
・1 <= B <= 13
・A,Bは整数

入力
A B

出力
勝った方の名前'Alice' or 'Bob'を出力、引き分けなら'Draw'を出力
"""

a, b = map(int, input().split())

if a == 1 and b == 1:
    a = 14
    b = 14
elif a == 1:
    a = 14
elif b == 1:
    b = 14

if a > b:
    print('Alice')
elif a < b:
    print('Bob')
else:
    print('Draw')
